#### Terraform Cloud Workspace 📂`cloudflare`
#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

The remote workspace is configured to work with configuration at
cloudflare relative to the target repository.

Terraform will upload the contents of the following directory,
excluding files or directories as defined by a .terraformignore file
at /home/runner/work/infra/infra/.terraformignore (if it is present),
in order to capture the filesystem context the remote workspace expects:
    /home/runner/work/infra/infra

To view this run in a browser, visit:
https://app.terraform.io/app/jakuboskera/cloudflare/runs/run-AKnYTD4wi2ny1YM5

Waiting for the plan to start...

Terraform v1.0.8
on linux_amd64
Initializing plugins and modules...
cloudflare_zone.jakuboskera_dev: Refreshing state... [id=efffdee59d36e33a2b771acb7974061f]
cloudflare_record.jakuboskera_dev_dmarc: Refreshing state... [id=4822b55dd9c2a1d76dcbfa7603c6767f]
cloudflare_record.jakuboskera_dev_domainconnect: Refreshing state... [id=705ec4ebae10382d15e1b3859d88f8d0]
cloudflare_record.jakuboskera_dev_mx02: Refreshing state... [id=2aad6874ca3ce24182e8b84d13b97b93]
cloudflare_record.jakuboskera_dev_sig1: Refreshing state... [id=173d4225b8649aadfd142f2a86ff14f0]
cloudflare_record.jakuboskera_dev_111: Refreshing state... [id=ca21b4eb80e0c1d03e6e1c6ea9d407f5]
cloudflare_record.jakuboskera_dev_110: Refreshing state... [id=08802f83deded05b69bf2aeec36daaf7]
cloudflare_record.jakuboskera_dev_109: Refreshing state... [id=36abf8eedc88aa38262e130dc89326f4]
cloudflare_record.jakuboskera_dev_spf1: Refreshing state... [id=ce7d6a1caec3efbc8b6f34d294db5251]
cloudflare_zone_settings_override.jakuboskera_dev: Refreshing state... [id=efffdee59d36e33a2b771acb7974061f]
cloudflare_record.jakuboskera_dev_personal: Refreshing state... [id=5880b8022bc054a2c481f462da002288]
cloudflare_record.www_jakuboskera_dev: Refreshing state... [id=71a785c52b5a617611205a9071350376]
cloudflare_record.guestbook_jakuboskera_dev: Refreshing state... [id=878849bcbe518de85ed5afe4a8b58d2e]
cloudflare_record.todo_jakuboskera_dev: Refreshing state... [id=00b0633676d3615d976e40637a6efa11]
cloudflare_record.acme_challenge_todo: Refreshing state... [id=23ab1830e62e13e10468f0288bcc59d3]
cloudflare_record.jakuboskera_dev_108: Refreshing state... [id=de032e29c2f42c84809dc66a424797a5]
cloudflare_record.acme_challenge_guestbook: Refreshing state... [id=8275fa9ea4dcebc1e931050ad07b4dd9]
cloudflare_record.jakuboskera_dev_mx01: Refreshing state... [id=bce2e48bacb0d0d9b9cf8c14141a0a3c]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # cloudflare_record.acme_challenge_guestbook will be updated in-place
  ~ resource "cloudflare_record" "acme_challenge_guestbook" {
        id              = "8275fa9ea4dcebc1e931050ad07b4dd9"
        name            = "_acme-challenge.guestbook"
      ~ value           = "guestbook.jakuboskera.dev.onoxke.flydns.net" -> "guestbook.jakuboskera.dev.onoxke.flydns.net."
        # (10 unchanged attributes hidden)
    }

  # cloudflare_record.acme_challenge_todo will be updated in-place
  ~ resource "cloudflare_record" "acme_challenge_todo" {
        id              = "23ab1830e62e13e10468f0288bcc59d3"
        name            = "_acme-challenge.todo"
      ~ value           = "todo.jakuboskera.dev.d80don.flydns.net" -> "todo.jakuboskera.dev.d80don.flydns.net."
        # (10 unchanged attributes hidden)
    }

  # cloudflare_record.guestbook_jakuboskera_dev must be replaced
-/+ resource "cloudflare_record" "guestbook_jakuboskera_dev" {
      ~ created_on      = "2021-10-12T11:48:15.719056Z" -> (known after apply)
      ~ hostname        = "guestbook.jakuboskera.dev" -> (known after apply)
      ~ id              = "878849bcbe518de85ed5afe4a8b58d2e" -> (known after apply)
      ~ metadata        = {
          - "auto_added"             = "false"
          - "managed_by_apps"        = "false"
          - "managed_by_argo_tunnel" = "false"
          - "source"                 = "primary"
        } -> (known after apply)
      ~ modified_on     = "2021-10-12T11:48:15.719056Z" -> (known after apply)
        name            = "guestbook"
      ~ proxiable       = true -> (known after apply)
      ~ proxied         = true -> false
      ~ type            = "CNAME" -> "AAAA" # forces replacement
      ~ value           = "octagonal-tangerine-mxjyk49l20i2oxn88433gmp6.herokudns.com" -> "2a09:8280:1::1:e863"
        # (3 unchanged attributes hidden)
    }

Plan: 1 to add, 2 to change, 1 to destroy.


```

</details>

*Pusher: @jakuboskera, Action: `pull_request`*